0Bu/daikin-altherma-esp32/main/http_config.cpp
    if (!broker.empty()) {
        // 1. WiFi connectivity check
        if (!wifi_info().connected) {
            httpd_resp_set_status(req, "400 Bad Request");
            return http_send_json(req, "{\"ok\":false,\"error\":\"WiFi not connected\"}");
        }

        // 2. Validate scheme / credentials leakage policy
        std::string test_uri = broker;
        const bool has_scheme = test_uri.find("://") != std::string::npos;
        const bool is_tls_check = test_uri.rfind("mqtts://", 0) == 0 || test_uri.rfind("wss://", 0) == 0;
        const bool has_creds = !user.empty() || !pass.empty();
        if (!has_scheme) test_uri = "mqtt://" + test_uri;

        if (has_creds && !is_tls_check) {
            httpd_resp_set_status(req, "400 Bad Request");
            return http_send_json(req, "{\"ok\":false,\"error\":\"Credentials require mqtts://\"}");
        }

        // 3. Parse host and port
        std::string host;
        int port = 0;
        bool is_tls = false;
        const char* uri_err = "Invalid broker URI";
        if (!parse_mqtt_uri(test_uri, host, port, is_tls, &uri_err)) {
            httpd_resp_set_status(req, "400 Bad Request");
            return http_send_json(req, (std::string("{\"ok\":false,\"error\":\"") + uri_err + "\"}").c_str());
        }

        // 4. Resolve DNS
        struct addrinfo hints{}, *res = nullptr;
        hints.ai_family = AF_INET;
        hints.ai_socktype = SOCK_STREAM;
        char port_str[16];
        std::snprintf(port_str, sizeof(port_str), "%d", port);
        int err = getaddrinfo(host.c_str(), port_str, &hints, &res);
        if (err != 0 || res == nullptr) {
            httpd_resp_set_status(req, "400 Bad Request");
            return http_send_json(req, "{\"ok\":false,\"error\":\"DNS lookup failed\"}");
        }
        struct sockaddr_in target_addr;
        std::memcpy(&target_addr, res->ai_addr, sizeof(struct sockaddr_in));
        freeaddrinfo(res);

        // 5. TCP connection probe
        if (!tcp_port_probe(target_addr.sin_addr, port, 3000)) {
            httpd_resp_set_status(req, "400 Bad Request");
            return http_send_json(req, "{\"ok\":false,\"error\":\"Broker port unreachable\"}");
        }

        // 6. Connect and authenticate with credentials — but only if the heap can afford it.
        // A TLS client spins up a full mbedTLS session (~16 KB in-buf + 4 KB out-buf, each ONE
        // contiguous block) ON TOP of the live bridge's own session. On a fragmented heap that second
        // session can exceed the largest free block and reboot the device. If we can't fit it, skip the
        // connect probe (DNS + port were already checked) and fall through to persist + reboot — the
        // boot path still surfaces a bad broker via /status.mqtt. Better a save without the deep check
        // than an OOM crash on the request path. Threshold is generous for the TLS case.
        const size_t need = is_tls ? 48u * 1024u : 12u * 1024u;
        MqttValidateCtx ctx{};                       // error_msg zero-inits to nullptr
        ctx.sem = xSemaphoreCreateBinary();
        if (ctx.sem && heap_caps_get_largest_free_block(MALLOC_CAP_DEFAULT) >= need) {
            esp_mqtt_client_config_t cfg = {};
            cfg.broker.address.uri = test_uri.c_str();
            if (is_tls) cfg.broker.verification.crt_bundle_attach = esp_crt_bundle_attach;
            cfg.credentials.client_id = "daikin_val";
            if (!user.empty()) cfg.credentials.username = user.c_str();
            if (!pass.empty()) cfg.credentials.authentication.password = pass.c_str();
            cfg.session.keepalive = 15;

            esp_mqtt_client_handle_t client = esp_mqtt_client_init(&cfg);
            if (!client) {
                vSemaphoreDelete(ctx.sem);
                httpd_resp_set_status(req, "500 Internal Server Error");
                return http_send_json(req, "{\"ok\":false,\"error\":\"MQTT init failed\"}");
            }

            esp_mqtt_client_register_event(client, static_cast<esp_mqtt_event_id_t>(MQTT_EVENT_ANY),
                                           on_mqtt_validate, &ctx);

            // A failed start never produces an event, so waiting on the semaphore would burn the full
            // 5 s and then blame a "connection timeout" — report the real cause immediately instead.
            // No stop() here: nothing was started.
            if (esp_mqtt_client_start(client) != ESP_OK) {
                esp_mqtt_client_destroy(client);
                vSemaphoreDelete(ctx.sem);
                httpd_resp_set_status(req, "500 Internal Server Error");
                return http_send_json(req, "{\"ok\":false,\"error\":\"MQTT client start failed\"}");
            }

            bool finished = xSemaphoreTake(ctx.sem, pdMS_TO_TICKS(5000)) == pdTRUE;

            esp_mqtt_client_stop(client);       // joins the mqtt task -> the callback can't touch ctx after this
            esp_mqtt_client_destroy(client);
            vSemaphoreDelete(ctx.sem);

            if (!finished) {
                httpd_resp_set_status(req, "400 Bad Request");
                return http_send_json(req, "{\"ok\":false,\"error\":\"MQTT connection timeout\"}");
            }
            if (!ctx.connected) {
                // error_msg is a string literal by construction (see MqttValidateCtx) — never broker
                // text, so it satisfies send_err's no-escaping precondition.
                return send_err(req, "400 Bad Request", ctx.error_msg ? ctx.error_msg : "MQTT connection refused");
            }
        } else {
            if (ctx.sem) vSemaphoreDelete(ctx.sem);
            diag_printf("mqtt: low heap, skipping broker connect probe (DNS+port ok) — saving anyway\n");
        }
    }

    c = config();
    c.mqtt_uri  = broker;
    c.mqtt_user = user;
    c.mqtt_pass = pass;
    // The broker just pre-flighted clean, so a failure here is NVS, not the user's input — don't
    // reboot into the old broker while telling them the new one was accepted.
    if (!config_save(c)) {
        httpd_resp_set_status(req, "500 Internal Server Error");
        return http_send_json(req, "{\"ok\":false,\"error\":\"config write failed\"}");
    }
    http_send_json(req, "{\"ok\":true,\"reboot\":true}");
    reboot_soon();
    return ESP_OK;
}

// Observation-only room/reference-temperature source. The mapping + freshness policy apply live on
// the existing MQTT connection; no averaging or heat-pump control consumes it yet.
static esp_err_t set_ref_temp(httpd_req_t* req) {
    char body[1024];
    if (http_read_body(req, body, sizeof(body)) < 0)
        return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    std::string name  = js(j, "name");
    std::string topic = js(j, "topic");
    std::string path  = js(j, "temperature_path");
    std::string time_path = js(j, "timestamp_path");
    cJSON* age_item = cJSON_GetObjectItem(j, "max_age_s");
    const bool age_type_valid = !age_item || (cJSON_IsNumber(age_item) &&
                                age_item->valuedouble == static_cast<double>(age_item->valueint));
    const uint32_t max_age_s = age_item && cJSON_IsNumber(age_item)
                             ? static_cast<uint32_t>(age_item->valueint)
                             : REF_TEMP_MAX_AGE_DEFAULT_S;
    cJSON_Delete(j);

    if (!age_type_valid) return send_err(req, "400 Bad Request", "Maximum age must be a whole number");
    if (topic.empty()) {                                 // empty topic is the explicit Off state
        path.clear();
        time_path.clear();
    }
    const char* why = nullptr;
    if (!reference_temperature_config_valid(name, topic, path, time_path, max_age_s, &why))
        return send_err(req, "400 Bad Request", why ? why : "invalid reference temperature config");

    Config c = config();
    if (c.ref_temp_name == name && c.ref_temp_topic == topic && c.ref_temp_path == path &&
        c.ref_temp_time_path == time_path && c.ref_temp_max_age_s == max_age_s) {
        mqtt_reference_reconfigure();                 // "test" also retries an unchanged mapping
        return http_send_json(req, "{\"ok\":true,\"saved\":false,\"reboot\":false}");
    }
    c.ref_temp_name = name;
    c.ref_temp_topic = topic;
    c.ref_temp_path = path;
    c.ref_temp_time_path = time_path;
    c.ref_temp_max_age_s = max_age_s;
    if (!config_save(c)) return send_err(req, "500 Internal Server Error", "config write failed");
    mqtt_reference_reconfigure();
    diag_printf("mqtt: reference temperature mapping saved%s\n", topic.empty() ? " (disabled)" : "");
    return http_send_json(req, "{\"ok\":true,\"saved\":true,\"reboot\":false}");
}

static esp_err_t set_hp(httpd_req_t* req) {
    char body[2048];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    Config c    = config();
    // The RX/TX pins are the physical X10A wiring: PERSISTED so a manual override survives a reboot
    // (config_save below). The model "profile" is session-only — only touched when the request
    // explicitly sends "profile"; a wiring-only patch omits it so it does not re-select the model or
    // invalidate a settled fingerprint (which would force a spurious re-detect next poll).
    cJSON* profItem     = cJSON_GetObjectItem(j, "profile");
    bool   profile_sent = cJSON_IsString(profItem);
    const int old_rx = c.rx_pin;
    const int old_tx = c.tx_pin;
    // "auto" (the UI's only value) requests a fresh detection; a concrete id pins the model for this
    // session (accepted for API flexibility, never offered in the UI).
    if (profile_sent) c.profile = profItem->valuestring;
    if (set_hp_clears_fingerprint(profile_sent, c.profile)) c.fp_valid = false;
    // proto is auto-detected (hp_detect.cpp), not set from the UI.
    c.rx_pin    = ji(j, "rx", c.rx_pin);
    c.tx_pin    = ji(j, "tx", c.tx_pin);
    const bool reset_checkup =
        set_hp_resets_checkup(profile_sent, old_rx, old_tx, c.rx_pin, c.tx_pin);
    // The HomeHub Modbus stack (issue #32). All optional — an omitted key keeps its stored value, so
    // a wiring-only patch (rx/tx) leaves the HomeHub untouched and the pin picker's
    // {profile:"auto",rx,tx} POST cannot switch anything on. This is a SECOND source, not an
    // alternative to X10A: enabling it starts a separate task, it does not stop the X10A poll.
    // HomeHub configuration has one unambiguous switch: a non-empty address enables polling; an
    // empty address disables the stack and causes no discovery or HomeHub request. Discovery is a
    // separate, explicit /discover_homehub action which only returns an address for the dialog; it
    // never mutates config behind the form's Save/Cancel boundary.
    cJSON* hostItem = cJSON_GetObjectItem(j, "mb_host");
    const bool host_sent = cJSON_IsString(hostItem);
    if (host_sent) c.mb_host = hostItem->valuestring;
    c.mb_port           = ji(j, "mb_port", c.mb_port);
    c.mb_unit_id        = ji(j, "mb_unit_id", c.mb_unit_id);
    c.actuation_enabled = jb(j, "actuation_enabled", c.actuation_enabled);
    cJSON_Delete(j);
    std::string reason;
    // Pass the real Kconfig-derived octal-SPI + status-LED facts (config.cpp) so validate() rejects a
    // chip-reserved GPIO — a flash/strapping/JTAG pad the UI dropdown never offers but a raw curl POST
    // could send — with the pin named, instead of range-accepting it and persisting a crash-loop pair.
    if (!validate(c, reason, SOC_GPIO_PIN_COUNT - 1, hw_octal_spi(), config_reserved_pins(c)))
        return send_err(req, "400 Bad Request", reason.c_str());
    // This route OWNS the pin cache, unlike the service routes whose link writes are only
    // best-effort maintenance. Require all three cache keys; on failure RAM stays untouched, so
    // there is no new link to hand the poll engine and reconfigure must be skipped.
    if (!config_save(c, /*require_link=*/true))
        return send_err(req, "500 Internal Server Error", "config write failed");
    if (reset_checkup) {
        checkup_reset();
        hp_poll_reconfigure();
    }
    // The HomeHub stack is told separately, because it IS separate: this starts or stops its task
    // and re-resolves its address without touching the X10A poll engine above.
    mb_reconfigure();
    return http_send_json(req, "{\"ok\":true}");
}

