0Bu/daikin-altherma-esp32/main/http_config.cpp
// Explicit HomeHub discovery for the edit dialog. This is intentionally NOT part of boot or of the
// Modbus poll task, and it does not save anything: the user sees the found IPv4 in the normal host
// field and decides with Save or Cancel whether it becomes configuration. A bounded miss returns
// control to that same field for manual entry.
static esp_err_t discover_homehub_now(httpd_req_t* req) {
    if (!wifi_info().connected)
        return send_err(req, "400 Bad Request", "WiFi not connected");
    std::string found;
    if (!mb_discover_homehub(found))
        return send_err(req, "404 Not Found", "No HomeHub found");
    // mb_discover_homehub returns a numeric IPv4 assembled by firmware, never caller text.
    const std::string body = std::string("{\"ok\":true,\"host\":\"") + found + "\"}";
    return http_send_json(req, body.c_str());
}

static esp_err_t set_syslog(httpd_req_t* req) {
    char body[512];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    std::string host = js(j, "host");
    int port = ji(j, "port", 514);
    cJSON_Delete(j);

    // Only the port range is validated synchronously (cheap). DNS resolution + reachability are done
    // asynchronously by the syslog task and surfaced via /status.syslog {resolved, reachable, error},
    // so the request path never blocks on a network probe. (/set_mqtt is the deliberate exception: it
    // pre-flights the broker connect synchronously so a bad address/credential is rejected at Save
    // rather than silently failing after the reboot — syslog is fire-and-forget UDP, MQTT is not.)
    if (!host.empty() && (port < 1 || port > 65535)) {
        httpd_resp_set_status(req, "400 Bad Request");
        return http_send_json(req, "{\"ok\":false,\"error\":\"port out of range\"}");
    }

    Config c = config();
    // Unchanged settings short-circuit — no NVS write, no reboot — exactly like /set_mqtt and
    // /set_ntp. A re-save of the same host/port would otherwise persist identical values and reboot,
    // dropping the poll cycle, MQTT availability and any open WebSocket for nothing. The UI already
    // handles {"reboot":false} (www/js/settings.js "No changes"). /set_wifi is deliberately NOT short-circuited:
    // a re-save there re-arms the credential-rollback trial.
    if (host == c.syslog_host && port == c.syslog_port)
        return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
    c.syslog_host = host;
    c.syslog_port = port;
    if (!config_save(c)) {
        httpd_resp_set_status(req, "500 Internal Server Error");
        return http_send_json(req, "{\"ok\":false,\"error\":\"config write failed\"}");
    }
    http_send_json(req, "{\"ok\":true,\"reboot\":true}");
    reboot_soon();
    return ESP_OK;
}

// POST /set_ntp {server} -> persist + reboot, mirroring /set_syslog: no request-path network probe
// (the SNTP client resolves + retries on its own task after reboot), an empty server is accepted —
// config_load() reads it as "reset to the CONFIG_DAIKIN_NTP_SERVER compile-time default" — and the
// only validation here is the same shape a hostname/IP field ever gets in this codebase (none; the
// SNTP client itself just fails to resolve a garbage name and keeps retrying, same as a bad syslog
// host does today).
static esp_err_t set_ntp(httpd_req_t* req) {
    char body[256];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    std::string server = js(j, "server");
    cJSON_Delete(j);

    Config c = config();
    if (server == c.ntp_server) return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
    c.ntp_server = server;
    if (!config_save(c)) {
        httpd_resp_set_status(req, "500 Internal Server Error");
        return http_send_json(req, "{\"ok\":false,\"error\":\"config write failed\"}");
    }
    http_send_json(req, "{\"ok\":true,\"reboot\":true}");
    reboot_soon();
    return ESP_OK;
}

// POST /set_board {led_gpio, led_type, led_inverted, btn_gpio, btn_active_low} -> validate + persist
// + reboot. This is the board's own hardware — which pin the status indicator is on, whether it is a
// plain LED or a WS2812, and which pin (if any) carries the factory-reset button — kept in NVS
// rather than Kconfig so ONE published image serves boards that disagree about their onboard parts.
//
// Unlike /set_hp (which applies pins live), this REBOOTS. Both settings are claimed once at task
// start: the indicator opens an RMT channel for a WS2812, the button installs a pull on its pin.
// Hot-swapping either means tearing down a running driver from a different task while it blinks —
// a whole class of failure bought for nothing, since changing an indicator pin is a once-per-board
// action. A reboot is also what the four service endpoints already do, so the UI path is identical.
static esp_err_t set_board(httpd_req_t* req) {
    char body[512];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    Config c = config();
    c.led_gpio       = ji(j, "led_gpio", c.led_gpio);
    c.led_type       = ji(j, "led_type", c.led_type);
    c.led_inverted   = jb(j, "led_inverted", c.led_inverted);
    c.btn_gpio       = ji(j, "btn_gpio", c.btn_gpio);
    c.btn_active_low = jb(j, "btn_active_low", c.btn_active_low);
    cJSON_Delete(j);
    // Submitting this form IS the user stating their hardware — that is the whole content of the
    // flag, so it is set for every accepted request rather than only when a value moved.
    c.board_user_set = true;

    std::string reason;
    // Checks the pins against the chip AND against the X10A link in the same snapshot, so neither
    // side can steal the other's GPIO whichever endpoint is called second (logic/config_model.hpp).
    if (!board_hw_valid(c, reason, SOC_GPIO_PIN_COUNT - 1, hw_octal_spi()))
        return send_err(req, "400 Bad Request", reason.c_str());

    // Two independent questions, and answering them with ONE comparison is what made a XIAO owner's
    // save vanish (#257): picking the preset your device already carries moves no VALUE, but it is
    // still the first time anyone stated what this board is. board_save_needed/board_reboot_needed
    // (logic/config_model.hpp, host-tested) keep them apart — persist the statement, but claim no
    // reboot for it, since no driver's pin changed.
    const Config& cur = config();
    if (!board_save_needed(c, cur))
        return http_send_json(req, "{\"ok\":true,\"reboot\":false}");   // nothing to write, no reboot

